import { Col, Container, Row } from "react-bootstrap";
import { Link, useLocation } from "react-router-dom";
import { useContext, useEffect, useState } from "react";
import city from "./citylist";
import MainTopSwiper from "../MainTopSwiper/MainTopSwiper";
import { MyContext } from "../../utils/Context";

const Header = ({ children }) => {
  const [openCity, setOpenCity] = useState(false);
  const [currentCity, setCurrentCity] = useState(city[0]);
  const pageName = useLocation();

  const clickOnCityHandler = () => {
    openCity ? setOpenCity(false) : setOpenCity(true);
  };

  const changeCityHandler = (e) => {
    setCurrentCity(e.target.textContent);
  };

  const listArrow = (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="8"
      height="6"
      fill="none"
      className="select__icon"
    >
      <path
        fill="#292929"
        d="M8 1.446 7.067.5 4 3.608.933.5 0 1.446 4 5.5l4-4.054Z"
      />
    </svg>
  );

  const formatBasketString = (length) => {
    if (!length) {
      return "товаров";
    } else if (length % 10 === 1 && length % 100 !== 11) {
      return "товар";
    } else if (
      [2, 3, 4].includes(length % 10) &&
      ![12, 13, 14].includes(length % 100)
    ) {
      return "товара";
    } else {
      return "товаров";
    }
  };

  const { basketCount } = useContext(MyContext);

  return (
    <header className="header">
      {pageName.pathname === "/" ? <MainTopSwiper /> : ""}
      <Container>
        <Row className="header__row">
          <Col xxl={5}>
            <nav className="nav">
              <ul className="nav__list">
                <li className="nav__item">
                  <Link to="/warranty" className="nav__link">
                    Гарантия свежести
                  </Link>
                </li>
                <li className="nav__item">
                  <Link to="/delivery" className="nav__link">
                    Доставка и оплата
                  </Link>
                </li>
                <li className="nav__item">
                  <Link to="/wholesale" className="nav__link">
                    Оптовые поставки
                  </Link>
                </li>
                <li className="nav__item">
                  <Link to="/contacts" className="nav__link">
                    Контакты
                  </Link>
                </li>
              </ul>
            </nav>
          </Col>
          <Col xxl={7} className="d-flex justify-content-between">
            <div className="header__city">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="16"
                height="22"
                fill="none"
                className="header__content-svg"
              >
                <path
                  stroke="#000"
                  strokeLinejoin="round"
                  d="M12.95 3.052A6.953 6.953 0 0 0 8 1c-1.87 0-3.627.729-4.95 2.052C.605 5.5.3 10.105 2.393 12.896L8.001 21l5.6-8.093c2.1-2.802 1.797-7.407-.65-9.855Zm-4.885 7.444A2.56 2.56 0 0 1 5.51 7.94a2.56 2.56 0 0 1 2.555-2.557 2.56 2.56 0 0 1 2.556 2.557 2.56 2.56 0 0 1-2.556 2.556Z"
                />
              </svg>
              <div
                className="header__select"
                onClick={() => clickOnCityHandler()}
              >
                <div className="select__title">{currentCity}</div>
                {listArrow}
                <div className={`select__collapse city-collapse`}>
                  {city.map((item, index) => (
                    <div
                      className="select__item city-select"
                      key={index}
                      onClick={(e) => changeCityHandler(e)}
                    >
                      {item}
                    </div>
                  ))}
                </div>
              </div>
            </div>
            <div className="header__phone">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="13"
                height="20"
                fill="none"
                className="header__content-svg"
              >
                <path
                  stroke="#000"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  strokeMiterlimit="10"
                  d="M10.183 18.983H2.817A1.816 1.816 0 0 1 1 17.165V2.817C1 1.861 1.765 1 2.817 1h7.366C11.139 1 12 1.765 12 2.817v14.348c0 .957-.86 1.818-1.817 1.818ZM2.722 15.348h7.556"
                />
                <path
                  fill="#000"
                  d="M6.357 17.835a.67.67 0 1 0 0-1.34.67.67 0 0 0 0 1.34Z"
                />
              </svg>
              <div className="header__phone-box">8 812 309-82-88</div>
            </div>
            <Link to="/basket" className="header__basket">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="16"
                height="22"
                fill="none"
              >
                <path
                  stroke="#000"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  strokeMiterlimit="10"
                  d="M15 5.604H1v15.41h14V5.603Z"
                />
                <path
                  stroke="#000"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  strokeMiterlimit="10"
                  d="M4.289 7.483V3.537C4.289 2.127 5.322 1 6.544 1h2.912c1.222 0 2.255 1.128 2.255 2.537v3.946"
                />
              </svg>
              <div className="header__basket-box">
                В корзине ({`${basketCount} ${formatBasketString(basketCount)}`}
                )
              </div>
            </Link>
            <div className="header__social">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="16"
                height="12"
                fill="none"
              >
                <path
                  fill="#000"
                  d="M14.973.047.34 5.123c-.474.165-.445.77.043.899l3.718.977 1.388 3.92c.145.41.728.534 1.065.227L8.477 9.4l3.772 2.465c.461.301 1.119.077 1.236-.422L15.983.808c.123-.52-.453-.954-1.01-.761Zm-1.835 2.36-6.797 5.35a.315.315 0 0 0-.12.208l-.262 2.07c-.009.068-.115.077-.138.012L4.745 6.96c-.05-.142.015-.295.156-.373l8.027-4.432c.184-.102.373.125.21.253Z"
                />
              </svg>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="17"
                height="11"
                fill="none"
              >
                <path
                  fill="#000"
                  fillRule="evenodd"
                  d="M8.343 10.454H9.35s.304-.034.46-.201c.142-.154.137-.442.137-.442s-.02-1.351.608-1.55c.618-.196 1.412 1.305 2.253 1.883.636.437 1.12.34 1.12.34l2.249-.03s1.177-.073.619-.998c-.046-.076-.325-.684-1.673-1.935-1.41-1.31-1.221-1.098.478-3.362 1.034-1.38 1.448-2.221 1.319-2.582-.124-.343-.885-.252-.885-.252l-2.532.015s-.188-.025-.327.058c-.136.082-.224.272-.224.272s-.4 1.067-.935 1.975c-1.128 1.915-1.579 2.016-1.763 1.897-.43-.277-.322-1.114-.322-1.708 0-1.855.281-2.63-.548-2.83-.275-.066-.478-.11-1.182-.117-.904-.01-1.669.003-2.102.215-.288.141-.51.455-.375.473.168.023.547.103.748.376.26.353.25 1.146.25 1.146s.15 2.185-.348 2.457c-.342.186-.81-.194-1.815-1.932-.515-.89-.904-1.873-.904-1.873s-.075-.184-.21-.283c-.162-.119-.388-.157-.388-.157L.65 1.325s-.361.01-.494.167c-.118.14-.01.429-.01.429s1.885 4.408 4.018 6.63c1.957 2.036 4.178 1.902 4.178 1.902Z"
                  clipRule="evenodd"
                />
              </svg>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="13"
                height="16"
                fill="none"
              >
                <path
                  fill="#000"
                  d="M6.118 8.47a4.24 4.24 0 0 0 4.235-4.235A4.24 4.24 0 0 0 6.118 0a4.24 4.24 0 0 0-4.236 4.235 4.24 4.24 0 0 0 4.236 4.236Zm0-6.352a2.12 2.12 0 0 1 2.117 2.117 2.12 2.12 0 0 1-2.117 2.118A2.12 2.12 0 0 1 4 4.235a2.12 2.12 0 0 1 2.118-2.117Z"
                />
                <path
                  fill="#000"
                  d="M11.916 7.825a1.158 1.158 0 0 0-1.546 0c-2.344 2.161-6.159 2.161-8.504 0a1.158 1.158 0 0 0-1.545 0 .953.953 0 0 0 0 1.426c1.36 1.254 3.083 1.969 4.86 2.155L2.066 14.28a.952.952 0 0 0 0 1.425 1.158 1.158 0 0 0 1.546 0l2.507-2.311 2.506 2.31c.213.197.493.296.773.296s.56-.099.773-.295a.952.952 0 0 0 0-1.425l-3.117-2.874c1.778-.186 3.502-.9 4.862-2.155a.954.954 0 0 0 0-1.426Z"
                />
              </svg>
            </div>
          </Col>
        </Row>
      </Container>
      <div className="header__bottom">
        <Container>
          <Row className="header__row">
            <Col xxl={5}>
              <nav className="header__nav">
                <ul className="header__nav-list">
                  <li className="header__nav-item">
                    <Link to="/promotions" className="nav-link">
                      СЛАДКИЕ ДНИ
                    </Link>
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      fill="none"
                    >
                      <circle cx="12" cy="12" r="12" fill="#E7426A" />
                      <path
                        fill="#fff"
                        d="M11.12 11.09c-.45.46-1.03.69-1.74.69s-1.29-.23-1.74-.69c-.44-.47-.66-1.055-.66-1.755 0-.71.224-1.3.674-1.77.45-.48 1.025-.72 1.725-.72.71 0 1.29.24 1.74.72.46.47.69 1.06.69 1.77 0 .7-.23 1.285-.69 1.755ZM9.243 17h-.81l6.39-10.005h.825L9.244 17Zm7.095-.51c-.45.46-1.03.69-1.74.69s-1.29-.23-1.74-.69c-.44-.47-.66-1.055-.66-1.755 0-.71.225-1.3.675-1.77.45-.48 1.025-.72 1.725-.72.71 0 1.29.24 1.74.72.45.47.675 1.06.675 1.77 0 .7-.225 1.285-.675 1.755ZM8.3 10.55c.28.32.64.48 1.08.48.44 0 .805-.16 1.095-.48.29-.33.435-.735.435-1.215 0-.5-.145-.91-.435-1.23-.28-.33-.645-.495-1.095-.495-.44 0-.8.165-1.08.495-.28.32-.42.73-.42 1.23 0 .48.14.885.42 1.215Zm5.205 5.4c.29.32.655.48 1.095.48.44 0 .805-.16 1.095-.48.29-.33.435-.735.435-1.215 0-.5-.145-.91-.435-1.23-.28-.33-.645-.495-1.095-.495-.45 0-.815.165-1.095.495-.28.32-.42.73-.42 1.23 0 .48.14.885.42 1.215Z"
                      />
                    </svg>
                  </li>
                  <li className="header__nav-item">
                    <div className="header__select">
                      <div className="select__title">ПОДАРОЧНЫЕ НАБОРЫ</div>
                      {listArrow}
                      <div className="select__collapse" style={{ left: "0" }}>
                        <div className="select__item">ПОДАРОЧНЫЕ НАБОРЫ</div>
                        <div className="select__item">ПОДАРОЧНЫЕ НАБОРЫ</div>
                        <div className="select__item">ПОДАРОЧНЫЕ НАБОРЫ</div>
                        <div className="select__item">ПОДАРОЧНЫЕ НАБОРЫ</div>
                      </div>
                    </div>
                  </li>
                  <li className="header__nav-item">
                    <Link to="/own-set" className="nav-link">
                      СОБРАТЬ НАБОР
                    </Link>
                  </li>
                </ul>
              </nav>
            </Col>
            <Col xxl={2} className="d-flex justify-content-center">
              <Link to="/">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="124"
                  height="125"
                  fill="none"
                >
                  <path
                    fill="#B3D9F3"
                    d="M105.925 105.925c-24.2 24.2-63.4 24.2-87.7 0-24.3-24.3-24.3-63.5 0-87.7 24.2-24.3 63.4-24.3 87.7 0 24.1 24.2 24.1 63.4 0 87.7Z"
                  />
                  <path
                    fill="#fff"
                    d="m79.325 40.025-.6 27.4s-3.4 4.2-16.8 4.2c-13.2 0-15.3-4.8-15.3-4.8l-.5-25.2c-.6.1.7 0 0 0-7.1.1-14.1-5.6-14.1-12.7s5.8-12.9 12.9-12.9c1.8 0 3.6.4 5.2 1.1 2.1-4.2 6.6-7.1 11.6-7.1 4.8 0 8.7 2.7 11 6.6 2.1-1.6 4.7-2.4 7.6-2.4 7.1 0 12.9 5.7 12.9 12.9.1 7.1-6.7 12.9-13.9 12.9.6 0-.4 0 0 0Z"
                  />
                  <path
                    fill="#000"
                    d="M27.726 56.725c0-1.1-.1-2-.2-2.5-.2-1.2-.8-2.3-1.8-3.2-1-.9-2.1-1.3-3.5-1.3s-2.7.5-3.7 1.5c-1.1-1-2.3-1.5-3.7-1.5-1.3 0-2.6.5-3.5 1.3-.9.8-1.6 1.8-1.9 3.2-.1.6-.2 1.4-.2 2.5v8.6c0 .5.4.7.7.7.5 0 .7-.4.7-.7v-8.9c0-1.6.3-2.9 1-3.9.7-1.1 1.8-1.6 3.3-1.6 1.1 0 2 .4 2.8 1.2-.7 1.2-1 2.5-1 4.3v8.8c0 .4.3.7.7.7.5 0 .7-.4.7-.7v-8.9c0-1.3.2-2.3.5-3 .3.8.5 2 .5 3.4v8.6c0 .4.3.7.7.7.5 0 .7-.4.7-.7v-9.2c0-1.8-.3-3.1-1-4.1.7-.7 1.6-1.1 2.7-1.1 1 0 1.9.3 2.6.9.7.5 1.2 1.3 1.5 2.3.2.6.2 1.3.2 2.3v8.9c0 .4.3.7.7.7.5 0 .7-.4.7-.7l-.1-.5v-8.1h-.1ZM43.926 52.225c-1.6-1.6-3.6-2.4-5.9-2.4-2.3 0-4.3.8-5.9 2.4-1.6 1.6-2.4 3.6-2.4 5.9 0 2.3.8 4.3 2.5 5.9 1.7 1.6 3.7 2.4 6 2.4 1.7 0 3.3-.5 4.6-1.4v.2c0 .7.4.9.7.9.3 0 .7-.3.7-.9v-1.3c1.6-1.7 2.4-3.6 2.4-5.8-.2-2.4-1.1-4.4-2.7-5.9Zm-1.3 6v5.2c-1.4 1.2-2.9 1.8-4.6 1.8-1.9 0-3.6-.7-4.9-2.1-1.4-1.3-2-2.9-2-4.9 0-2 .7-3.6 2.1-5 1.4-1.4 3-2.1 5-2.1 1.9 0 3.6.7 4.9 2.1 1.3 1.4 2.1 3 2.1 4.9 0 1.4-.4 2.6-1.1 3.7v-3.6c-.2-1-1.5-1-1.5 0ZM55.425 66.425c1.9 0 3.7-.6 5.3-1.9.4-.3.7-.5.9-.8h.1v-.1c.1-.1.1-.2.1-.4 0-.3-.2-.6-.6-.6h-.4l-.1.2v.2c-.7.6-1.5 1.2-2.3 1.6-.9.4-1.9.7-2.8.7-2 0-3.6-.7-4.9-2.1-1.4-1.4-2.1-3-2.1-5 0-1.9.7-3.6 2.1-4.9 1.3-1.4 2.9-2 4.9-2 1.9 0 3.6.7 5 2.1l.3.2h.4l.1-.1c.2-.1.3-.3.3-.5v-.2l-.1-.1s0-.1-.1-.1c-.1-.1-.1-.2-.2-.2-1.5-1.6-3.5-2.5-5.9-2.5-2.3 0-4.3.8-5.9 2.4-1.6 1.6-2.4 3.6-2.4 5.9 0 2.2.8 4.2 2.4 5.9 1.7 1.5 3.7 2.3 5.9 2.3ZM76.026 52.225c-1.6-1.6-3.6-2.4-5.9-2.4-2.3 0-4.3.8-5.9 2.4-1.6 1.6-2.4 3.6-2.4 5.9 0 2.3.8 4.3 2.4 5.9 1.7 1.6 3.7 2.4 6 2.4 1.7 0 3.3-.5 4.6-1.4v.2c0 .7.4.9.7.9.3 0 .7-.3.7-.9v-1.3c1.6-1.7 2.4-3.6 2.4-5.8-.1-2.5-.9-4.4-2.6-5.9Zm-1.3 6v5.2c-1.4 1.2-2.9 1.8-4.6 1.8-1.9 0-3.6-.7-5-2.1-1.4-1.3-2-2.9-2-4.9 0-2 .7-3.6 2.1-5 1.4-1.4 3-2.1 5-2.1 1.9 0 3.6.7 4.9 2.1 1.4 1.4 2.1 3 2.1 4.9 0 1.4-.4 2.7-1.1 3.8v-3.6c-.1-1.1-1.4-1.1-1.4-.1ZM80.626 66.125c.5 0 .7-.4.7-.7v-6.5c0-1.7.1-2.7.3-3.4.3-1.1.9-2 1.7-2.7.8-.7 1.7-1.1 2.7-1.4.5 0 .7-.4.7-.7 0-.5-.3-.6-.5-.7h-.2c-.5 0-1.1.2-1.8.6-1.2.6-2.2 1.4-2.9 2.5v-2.3c0-1-1.4-1-1.4 0v14.6c0 .4.3.7.7.7ZM101.225 52.225c-1.6-1.6-3.6-2.4-5.9-2.4-2.3 0-4.3.8-5.9 2.4-1.6 1.6-2.4 3.6-2.4 5.9 0 2.3.8 4.3 2.4 5.9 1.7 1.6 3.7 2.4 6 2.4s4.3-.8 5.9-2.5c1.6-1.7 2.4-3.7 2.4-6 0-2.2-.8-4.2-2.5-5.7Zm-5.9-1.1c1.9 0 3.6.7 4.9 2.1 1.4 1.4 2.1 3 2.1 4.9 0 2-.7 3.7-2.2 5-1.3 1.4-2.9 2-4.9 2-1.9 0-3.6-.7-4.9-2.1-1.4-1.4-2.1-3-2.1-4.9 0-2 .7-3.6 2.1-5 1.3-1.4 3-2 5-2ZM116.725 54.025c-.2-1.2-.8-2.2-1.9-3.1-1-.8-2.2-1.3-3.5-1.3-1 0-1.9.2-2.7.7-.6.4-1.2.8-1.6 1.4v-1c0-1-1.4-1-1.4 0v14.6c0 .5.4.7.7.7.5 0 .7-.4.7-.7v-8.3c0-.9 0-1.7.1-2.1.2-1.2.6-2.1 1.3-2.8.8-.7 1.8-1.1 2.8-1.1.8 0 1.6.2 2.2.6.9.5 1.5 1.3 1.7 2.3.2.6.2 1.7.2 3.1v8.3c0 .4.3.7.7.7.2 0 .4-.1.5-.2h.3v-9.5c.1-.9 0-1.7-.1-2.3ZM40.525 85.325c-.7 0-.8.4-.8.7 0 .5.4.7.7.7.8 0 1.4.2 2.1.6 1.3.7 2 1.9 2 3.4 0 1.1-.4 2-1.2 2.8-.8.8-1.7 1.2-2.8 1.2-1.6 0-2.7-.7-3.6-2.1-.3-.4-.5-1-.5-1.7 0-.5-.3-.8-.7-.8-.5 0-.7.4-.7.7 0 1.4.6 2.7 1.7 3.6 1 1 2.3 1.5 3.7 1.5 1.5 0 2.8-.5 3.8-1.6 1-1 1.6-2.3 1.6-3.8s-.5-2.7-1.5-3.7c-1-.9-2.3-1.5-3.8-1.5Z"
                  />
                  <path
                    fill="#000"
                    d="M40.225 81.125c1.3 0 2.2.5 2.8 1.6.1.2.3.6.4 1 0 .5.3.8.7.8.4 0 .7-.3.7-.7 0-1.2-.6-2.2-1.6-2.8-.9-.8-1.9-1.2-3.1-1.2-1.2 0-2.3.4-3.2 1.3-.8 1-1.3 2-1.3 3.2 0 1.2.4 2.3 1.3 3.2.8.9 1.9 1.4 3.1 1.4.5 0 .8-.3.8-.7 0-.4-.3-.7-.7-.7-.9 0-1.6-.3-2.2-.9-.6-.6-.9-1.4-.9-2.3 0-.9.3-1.7.9-2.3.8-.6 1.5-.9 2.3-.9ZM57.925 86.525c0-1.1-.1-1.9-.2-2.4-.3-1.3-.9-2.3-1.8-3-1-.9-2-1.3-3.3-1.3-.9 0-1.8.2-2.6.7-.7.3-1.2.8-1.6 1.3v-6c0-1-1.4-1-1.4 0v19.1c0 .5.4.7.7.7.5 0 .7-.4.7-.7v-8c0-.6 0-1.1.1-1.5v-.6c.2-1.1.6-2 1.3-2.7.8-.7 1.6-1 2.8-1 .8 0 1.6.2 2.2.6.9.6 1.4 1.3 1.6 2.2.2.6.2 1.6.2 3v8c0 .4.3.7.7.7.5 0 .7-.4.7-.7l-.1-.5v-7.9ZM73.325 82.125c-1.6-1.6-3.5-2.4-5.7-2.4s-4.2.8-5.7 2.4c-1.6 1.6-2.4 3.5-2.4 5.7s.8 4.2 2.4 5.7c1.6 1.6 3.5 2.4 5.8 2.4s4.2-.8 5.7-2.4c1.6-1.6 2.4-3.5 2.4-5.8s-.8-4.1-2.5-5.6Zm-10.5 10.5c-1.3-1.3-2-2.9-2-4.8s.7-3.5 2-4.9c1.3-1.3 2.9-2 4.9-2 1.8 0 3.5.7 4.8 2 1.3 1.3 2 2.9 2 4.8s-.7 3.6-2.1 4.9c-1.3 1.3-2.9 2-4.8 2-1.8 0-3.5-.7-4.8-2ZM85.225 79.725c-2.3 0-4.2.8-5.7 2.4-1.5 1.6-2.4 3.5-2.4 5.7s.8 4.1 2.3 5.7v6.5c0 .4.3.7.7.7.5 0 .7-.4.7-.7v-5.3c1.3.9 2.8 1.3 4.4 1.3 2.3 0 4.3-.8 5.8-2.3 1.6-1.6 2.5-3.4 2.5-5.7 0-2.3-.9-4.2-2.5-5.8-1.6-1.7-3.5-2.5-5.8-2.5Zm-5.1 7.4c-.3 0-.7.3-.7.8v3.4c-.6-1-.9-2.2-.9-3.5 0-1.8.7-3.5 2-4.8 1.4-1.4 3-2 4.9-2 1.9 0 3.5.7 4.9 2 1.3 1.3 2 2.9 2 4.9 0 1.9-.7 3.5-2.1 4.8-1.3 1.3-2.9 2-4.8 2-1.7 0-3.2-.6-4.5-1.8v-5c-.1-.7-.5-.8-.8-.8ZM56.726 102.325v7.2l6.5-3.7-6.5-3.5Z"
                  />
                  <path fill="#000" d="M69.426 102.325v7.2l-6.5-3.7 6.5-3.5Z" />
                </svg>
              </Link>
            </Col>
            <Col xxl={5}>
              <nav className="header__nav">
                <ul className="header__nav-list">
                  <li className="header__nav-item">
                    <Link to="/own-design" className="nav-link">
                      Создать дизайн
                    </Link>
                  </li>
                  <li className="header__nav-item">
                    <div className="header__select">
                      <div className="select__title">Компаниям</div>
                      {listArrow}
                      <div className="select__collapse">
                        <div className="select__item">Компаниям</div>
                        <div className="select__item">Компаниям</div>
                        <div className="select__item">Компаниям</div>
                        <div className="select__item">Компаниям</div>
                      </div>
                    </div>
                  </li>
                  <li className="header__nav-item">
                    <div className="header__select">
                      <div className="select__title">Весь каталог</div>
                      {listArrow}
                      <div className="select__collapse">
                        <div className="select__item">Пирожные макарон</div>
                        <div className="select__item">Эклеры</div>
                        <div className="select__item">Вафельные трубочки</div>
                        <div className="select__item">Профитроли</div>
                      </div>
                    </div>
                  </li>
                </ul>
              </nav>
            </Col>
          </Row>
        </Container>
      </div>
    </header>
  );
};

export default Header;
